app/controllers/api/v1/picks_controller.rb

SELECT "picks".* FROM "picks"
---
  def index
   @picks = Pick.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "picks".* FROM "picks" WHERE "picks"."user_id" = $1 ORDER BY "picks"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
UPDATE "picks" SET "guess_id" = $1, "updated_at" = $2 WHERE "picks"."id" = $3  [["guess_id", 1], ["updated_at", "2017-10-24 21:58:06.531570"], ["id", 2]]
UPDATE "users" SET "total_picks" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["total_picks", 1], ["updated_at", "2017-10-25 17:31:19.491647"], ["id", 1]]
INSERT INTO "picks" ("game_id", "user_id", "guess_id", "created_at", "updated_at", "week_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["game_id", 7], ["user_id", 1], ["guess_id", 24], ["created_at", "2017-10-25 13:50:57.903187"], ["updated_at", "2017-10-25 13:50:57.903187"], ["week_id", 7]]
---
  def create
    @user = User.find(params[:user_id])
    params[:_json].each do |pick|
      if @user.games_picked.include?(pick[:gameId])
        @pick = @user.picks.find do |user_pick|
          user_pick.game_id == pick[:gameId]
        end
        @pick.update(guess_id: pick[:guessId])
      else
        @pick = Pick.create(game_id: pick[:gameId], guess_id: pick[:guessId], week: Week.get_week_by_week_number(pick[:weekNumber]), user: @user)