app/controllers/api/v1/users_controller.rb

     def create
       @user = User.create(name: params[:_json])
---
INSERT INTO "users" ("name", "wins", "created_at", "updated_at", "total_picks") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Ben"], ["wins", 0], ["created_at", "2017-10-26 00:17:08.020568"], ["updated_at", "2017-10-26 00:17:08.020568"], ["total_picks", 0]]

     def show_week
       @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

     def user_by_name
       name = params[:name]
       @user = User.where('lower(name) = ?', name.downcase).first
---
SELECT  "users".* FROM "users" WHERE (lower(name) = 'al') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]