app/controllers/api/v1/weeks_controller.rb

SELECT "weeks".* FROM "weeks"
---
  def index
   @weeks = Week.all

SELECT  "weeks".* FROM "weeks" WHERE "weeks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
 def show
   @week = Week.find(params[:id])

SELECT  "weeks".* FROM "weeks" WHERE "weeks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "picks".* FROM "picks" WHERE "picks"."week_id" = $1  [["week_id", 7]]
---
 def show_picks
   @week = Week.find(params[:id])
   @pick = @week.picks.select do |pick|